# CannotCutJoinedGeometry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..CannotCutJoinedGeometry Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
Element could not be cut by joined element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCutJoinedGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCutJoinedGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCutJoinedGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace